In [1]:
import pandas as pd

In [4]:
dict1 = {
    'Name': ['Agrim', 'Ankit', 'Adarsh', 'Eve', 'Mat', 'Sophia', 'Liam', 'Olivia', 'Noah', 'Emma'],
    'Marks': [85, 78, 92, 88, 74, 91, 82, 95, 76, 89],
    'Gender': ['Male', 'Male', 'Male', 'Female', 'Male', 'Female', 'Male', 'Female', 'Male', 'Female']
}
df1=pd.DataFrame(dict1)
df1

     Name  Marks  Gender
0   Agrim     85    Male
1   Ankit     78    Male
2  Adarsh     92    Male
3     Eve     88  Female
4     Mat     74    Male
5  Sophia     91  Female
6    Liam     82    Male
7  Olivia     95  Female
8    Noah     76    Male
9    Emma     89  Female

In [7]:
df1.head(3)

     Name  Marks Gender
0   Agrim     85   Male
1   Ankit     78   Male
2  Adarsh     92   Male

In [9]:
df1.tail(3)

     Name  Marks  Gender
7  Olivia     95  Female
8    Noah     76    Male
9    Emma     89  Female

In [10]:
df1.shape

(10, 3)

In [13]:
print('Number of Rows', df1.shape[0])
print('Number of Columns', df1.shape[1])

Number of Rows 10
Number of Columns 3

In [15]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    10 non-null     object
 1   Marks   10 non-null     int64
 2   Gender  10 non-null     object
dtypes: int64(1), object(2)
memory usage: 368.0+ bytes

In [17]:
df1.isnull().sum()

Name      0
Marks     0
Gender    0
dtype: int64

In [18]:
df1.describe()

           Marks
count  10.000000
mean   85.000000
std     7.226494
min    74.000000
25%    79.000000
50%    86.500000
75%    90.500000
max    95.000000

In [19]:
df1.head()

     Name  Marks  Gender
0   Agrim     85    Male
1   Ankit     78    Male
2  Adarsh     92    Male
3     Eve     88  Female
4     Mat     74    Male

In [20]:
df1['Gender'].unique()

array(['Male', 'Female'], dtype=object)

In [21]:
df1['Gender'].nunique()

2

In [23]:
df1['Gender'].value_counts()

Gender
Male      6
Female    4
Name: count, dtype: int64

In [25]:
df1[df1['Marks']>=90]

     Name  Marks  Gender
2  Adarsh     92    Male
5  Sophia     91  Female
7  Olivia     95  Female

In [30]:
len(df1[(df1['Marks']>=90) & (df1['Marks']<=100)])

3

In [32]:
sum(df1['Marks'].between(90,100))

3

In [34]:
df1['Marks'].mean()

85.0

In [35]:
df1['Marks'].max()

95

In [36]:
df1['Marks'].min()

74

In [37]:
def marks(x):
    return x/2

In [40]:
df1['Half_marks']=df1['Marks'].apply(marks)

In [41]:
df1

     Name  Marks  Gender  Half_marks
0   Agrim     85    Male        42.5
1   Ankit     78    Male        39.0
2  Adarsh     92    Male        46.0
3     Eve     88  Female        44.0
4     Mat     74    Male        37.0
5  Sophia     91  Female        45.5
6    Liam     82    Male        41.0
7  Olivia     95  Female        47.5
8    Noah     76    Male        38.0
9    Emma     89  Female        44.5

In [43]:
df1['Marks'].apply(lambda x:x//2)

0    42
1    39
2    46
3    44
4    37
5    45
6    41
7    47
8    38
9    44
Name: Marks, dtype: int64

In [45]:
df1['Name'].apply(len)

0    5
1    5
2    6
3    3
4    3
5    6
6    4
7    6
8    4
9    4
Name: Name, dtype: int64

In [47]:
df1['Male_Female']=df1['Gender'].map({'Male':1, 'Female':0})

In [48]:
df1

     Name  Marks  Gender  Half_marks  Male_Female
0   Agrim     85    Male        42.5            1
1   Ankit     78    Male        39.0            1
2  Adarsh     92    Male        46.0            1
3     Eve     88  Female        44.0            0
4     Mat     74    Male        37.0            1
5  Sophia     91  Female        45.5            0
6    Liam     82    Male        41.0            1
7  Olivia     95  Female        47.5            0
8    Noah     76    Male        38.0            1
9    Emma     89  Female        44.5            0

In [50]:
df1.drop(['Male_Female','Half_marks'], axis=1, inplace=True)

In [51]:
df1

     Name  Marks  Gender
0   Agrim     85    Male
1   Ankit     78    Male
2  Adarsh     92    Male
3     Eve     88  Female
4     Mat     74    Male
5  Sophia     91  Female
6    Liam     82    Male
7  Olivia     95  Female
8    Noah     76    Male
9    Emma     89  Female

In [52]:
df1.columns

Index(['Name', 'Marks', 'Gender'], dtype='object')

In [53]:
df1.index

RangeIndex(start=0, stop=10, step=1)

In [56]:
df1.sort_values(by=['Marks', 'Gender'])

     Name  Marks  Gender
4     Mat     74    Male
8    Noah     76    Male
1   Ankit     78    Male
6    Liam     82    Male
0   Agrim     85    Male
3     Eve     88  Female
9    Emma     89  Female
5  Sophia     91  Female
2  Adarsh     92    Male
7  Olivia     95  Female

In [61]:
df1[df1['Gender']=='Female'][['Name', 'Marks']]

     Name  Marks
3     Eve     88
5  Sophia     91
7  Olivia     95
9    Emma     89